//24.9.4(수) 테트로미노
#include<iostream>
#include<algorithm>
using namespace std;
int main(){
    ios::sync_with_stdio(0);cin.tie(0);
    int n,m; cin>>n>>m;

    //tetromino
    int tet_cnt = 19;
    int tet[19][4][2] = {
        {{0,0},{0,1},{0,2},{0,3}}, //1
        {{0,0},{1,0},{2,0},{2,1}}, //2
        {{0,0},{1,0},{1,1},{2,1}}, //3
        {{0,0},{0,1},{1,0},{1,1}}, //4
        {{0,0},{0,1},{0,2},{1,1}}, //5
        {{0,0},{1,0},{2,0},{3,0}}, //6
        {{0,0},{1,0},{2,0},{1,1}}, //7
        {{0,0},{0,1},{-1,1},{-1,2}}, //8
        {{0,0},{0,1},{0,2},{-1,2}}, //9
        {{0,0},{0,1},{0,2},{-1,1}}, //10
        {{0,0},{0,1},{1,1},{2,1}}, //11
        {{0,0},{0,1},{0,2},{1,0}}, //12
        {{0,0},{-1,1},{0,1},{1,1}}, //13

        {{0,0},{1,0},{2,0},{2,-1}},//14
        {{0,0},{1,0},{0,1},{-1,1}},//15
        {{0,0},{0,1},{0,2},{-1,0}},//16
        {{0,0},{0,1},{1,1},{1,2}},//17
        {{0,0},{0,1},{1,0},{2,0}},//18
        {{0,0},{0,1},{0,2},{1,2}}//19
    };

    int board[501][501];
    for(int i=0;i<n;i++){
        for(int j=0;j<m;j++){
            cin>>board[i][j];
        }
    }

    int sum;
    int ret=0;
    for(int i=0;i<n;i++){
        for(int j=0;j<m;j++){
            
            // 각 테트로미노 타입에 대해 돌기
            for(int type=0;type<tet_cnt;type++){
                sum=0;
                bool isEnd = 0;

                for(int pos=0;pos<4;pos++){
                    
                    int y= i+tet[type][pos][0];
                    int x=j+tet[type][pos][1];

                    //범위 안에 있다면 
                    if(0<=y && y<n && 0<=x && x<m){
                        sum+=board[y][x];
                    }else{
                        // 범위를 벗어났다면 다음 테트로미노로 
                        isEnd=1;
                        break;
                    }
                }//for pos

                if(isEnd==1){
                    // 범위를 벗어났다면 다음 테트로미노로 
                    continue;
                }

                ret=max(ret,sum);

            }//for type
        }
    }

    cout<<ret<<endl;
}

